# Задача 1.3.

# Напишите скрипт, который принимает от пользователя номер месяца, 
# а возвращает количество дней в нем.
# Результат проверки вывести на консоль
# Допущение: в феврале 28 дней
# Если номер месяца некорректен - сообщить об этом
month = input('Введите номер месяца: ')
if month == '1':
    print('Вы ввели январь. 31 день')
elif month == '2':
    print('Вы ввели февраль. 28 или 29 дней')
elif month == '3':
    print('Вы ввели март. 31 день')
elif month == '4':
    print('Вы ввели апрель. 30 дней')
elif month == '5':
    print('Вы ввели май. 31 день')
elif month == '6':
    print('Вы ввели июнь. 30 дней')
elif month == '7':
    print('Вы ввели июль. 31 день')
elif month == '8':
    print('Вы ввели август. 31 день')
elif month == '9':
    print('Вы ввели сентябрь. 30 дней')
elif month == '10':
    print('Вы ввели октябрь. 31 день')
elif month == '11':
    print('Вы ввели ноябрь. 30 дней')
elif month == '12':
    print('Вы ввели декабрь. 31 день')
else:
    print('Такого месяца нет')

# Например,
    # Введите номер месяца: 3
    # Вы ввели март. 31 дней

    # Введите номер месяца: 2
    # Вы ввели февраль. 28 дней

    # Введите номер месяца: 15
    # Такого месяца нет!
    
#  Ох) ну многовато elif, есть же одинаковые кол-ва дней в месяце
# Вариант 1
user_input = input("Введите номер месяца: ")
month = int(user_input)
print('Вы ввели', month)

if month in [1, 3, 5, 7, 8, 10, 12]:
    print(31)
elif month in [4, 6, 9, 11]:
    print(30)
elif month == 2:
    print(28)
else:
    print('Введен неправильный номер месяца!')
    
# Вот вариант через словари, вообще elif не нужен
m = int(input('Введите номер месяца и нажмите Enter: '))
months = {1:'январь, 31 день', 2:'февраль, 28 дней', 3:'март, 31 день', 4:'апрель, 30 дней', 5:'май, 31 день', 6:'июнь, 30 дней', 7 :'июль, 31 день', 8 : 'август, 31 день', 9 :'сенябрь, 30 дней', 10 :'октябрь, 31 день', 11 :'ноябрь, 30 дней', 12 :'декабрь, 31 день'}

if m in months:
    print(f"Вы ввели {months[m]}")
else:
    print('Такого месяца нет!')
